#### Terraform Plan

<details><summary>Show Plan</summary>

```
data.aws_region.Region: Reading...
data.aws_region.Region: Read complete after 0s [id=us-east-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.cloudWebsite_AllowDistributionReadOnly_89DC4FD0 will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "cloudWebsite_AllowDistributionReadOnly_89DC4FD0" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "AWS:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # data.aws_lambda_invocation.InitializeTable_Invocation_6E01246F will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_lambda_invocation" "InitializeTable_Invocation_6E01246F" {
      + function_name = "Function-c8e7055b"
      + id            = (known after apply)
      + input         = jsonencode({})
      + result        = (known after apply)
    }

  # aws_api_gateway_deployment.VotingAppApi_api_deployment_B9647894 will be created
  + resource "aws_api_gateway_deployment" "VotingAppApi_api_deployment_B9647894" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + triggers      = (known after apply)
    }

  # aws_api_gateway_rest_api.VotingAppApi_api_CB41EC98 will be created
  + resource "aws_api_gateway_rest_api" "VotingAppApi_api_CB41EC98" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + body                         = (known after apply)
      + created_date                 = (known after apply)
      + description                  = (known after apply)
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = -1
      + name                         = "api-c8bc2868"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags_all                     = (known after apply)
    }

  # aws_api_gateway_stage.VotingAppApi_api_stage_9B2FA9EA will be created
  + resource "aws_api_gateway_stage" "VotingAppApi_api_stage_9B2FA9EA" {
      + arn           = (known after apply)
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + stage_name    = "prod"
      + tags_all      = (known after apply)
      + web_acl_arn   = (known after apply)
    }

  # aws_cloudfront_distribution.cloudWebsite_Distribution_083B5AF9 will be created
  + resource "aws_cloudfront_distribution" "cloudWebsite_Distribution_083B5AF9" {
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + default_root_object            = "index.html"
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = false
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_100"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags_all                       = (known after apply)
      + trusted_key_groups             = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = true
          + default_ttl            = 3600
          + max_ttl                = 86400
          + min_ttl                = 0
          + target_origin_id       = "s3Origin"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = (known after apply)
          + origin_access_control_id = (known after apply)
          + origin_id                = "s3Origin"
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + cloudfront_default_certificate = true
          + minimum_protocol_version       = "TLSv1"
        }
    }

  # aws_cloudfront_origin_access_control.cloudWebsite_CloudfrontOac_C956968B will be created
  + resource "aws_cloudfront_origin_access_control" "cloudWebsite_CloudfrontOac_C956968B" {
      + description                       = "Managed by Terraform"
      + etag                              = (known after apply)
      + id                                = (known after apply)
      + name                              = "cloud-We-c8e58765-cloudfront-oac"
      + origin_access_control_origin_type = "s3"
      + signing_behavior                  = "always"
      + signing_protocol                  = "sigv4"
    }

  # aws_cloudwatch_log_group.InitializeTable_Function_CloudwatchLogGroup_E746307D will be created
  + resource "aws_cloudwatch_log_group" "InitializeTable_Function_CloudwatchLogGroup_E746307D" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/Function-c8e7055b"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_cloudwatch_log_group.VotingAppApi_VotingAppApi-OnRequest-41f14472_CloudwatchLogGroup_6240AD7B will be created
  + resource "aws_cloudwatch_log_group" "VotingAppApi_VotingAppApi-OnRequest-41f14472_CloudwatchLogGroup_6240AD7B" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/VotingAppApi-OnRequest-41f14472-c87bddf9"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_cloudwatch_log_group.VotingAppApi_VotingAppApi-OnRequest-52bc3c17_CloudwatchLogGroup_B868F507 will be created
  + resource "aws_cloudwatch_log_group" "VotingAppApi_VotingAppApi-OnRequest-52bc3c17_CloudwatchLogGroup_B868F507" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/VotingAppApi-OnRequest-52bc3c17-c89daf14"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_cloudwatch_log_group.VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_CloudwatchLogGroup_D05DD3A3 will be created
  + resource "aws_cloudwatch_log_group" "VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_CloudwatchLogGroup_D05DD3A3" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/VotingAppApi-OnRequest-8d2e75ec-c8cf8e09"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_dynamodb_table.VotingAppStore_Entries_DynamoDBTableAws_tfawsdynamodbTableDynamodbTable_894280AD will be created
  + resource "aws_dynamodb_table" "VotingAppStore_Entries_DynamoDBTableAws_tfawsdynamodbTableDynamodbTable_894280AD" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "Name"
      + id               = (known after apply)
      + name             = "DynamoDBTableAws-4b65a10e"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = (known after apply)

      + attribute {
          + name = "Name"
          + type = "S"
        }
    }

  # aws_iam_role.InitializeTable_Function_IamRole_E3F0843D will be created
  + resource "aws_iam_role" "InitializeTable_Function_IamRole_E3F0843D" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.VotingAppApi_VotingAppApi-OnRequest-41f14472_IamRole_5F3056C5 will be created
  + resource "aws_iam_role" "VotingAppApi_VotingAppApi-OnRequest-41f14472_IamRole_5F3056C5" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.VotingAppApi_VotingAppApi-OnRequest-52bc3c17_IamRole_CBB68D47 will be created
  + resource "aws_iam_role" "VotingAppApi_VotingAppApi-OnRequest-52bc3c17_IamRole_CBB68D47" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_IamRole_0FF833EF will be created
  + resource "aws_iam_role" "VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_IamRole_0FF833EF" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy.InitializeTable_Function_IamRolePolicy_2AD89519 will be created
  + resource "aws_iam_role_policy" "InitializeTable_Function_IamRolePolicy_2AD89519" {
      + id     = (known after apply)
      + name   = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "none:null"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # aws_iam_role_policy.VotingAppApi_VotingAppApi-OnRequest-41f14472_IamRolePolicy_25C9720E will be created
  + resource "aws_iam_role_policy" "VotingAppApi_VotingAppApi-OnRequest-41f14472_IamRolePolicy_25C9720E" {
      + id     = (known after apply)
      + name   = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "none:null"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # aws_iam_role_policy.VotingAppApi_VotingAppApi-OnRequest-52bc3c17_IamRolePolicy_0F307DC9 will be created
  + resource "aws_iam_role_policy" "VotingAppApi_VotingAppApi-OnRequest-52bc3c17_IamRolePolicy_0F307DC9" {
      + id     = (known after apply)
      + name   = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "none:null"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # aws_iam_role_policy.VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_IamRolePolicy_2D34FA97 will be created
  + resource "aws_iam_role_policy" "VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_IamRolePolicy_2D34FA97" {
      + id     = (known after apply)
      + name   = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "none:null"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # aws_iam_role_policy_attachment.InitializeTable_Function_IamRolePolicyAttachment_4435DE19 will be created
  + resource "aws_iam_role_policy_attachment" "InitializeTable_Function_IamRolePolicyAttachment_4435DE19" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = (known after apply)
    }

  # aws_iam_role_policy_attachment.VotingAppApi_VotingAppApi-OnRequest-41f14472_IamRolePolicyAttachment_E1980EB1 will be created
  + resource "aws_iam_role_policy_attachment" "VotingAppApi_VotingAppApi-OnRequest-41f14472_IamRolePolicyAttachment_E1980EB1" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = (known after apply)
    }

  # aws_iam_role_policy_attachment.VotingAppApi_VotingAppApi-OnRequest-52bc3c17_IamRolePolicyAttachment_92A90320 will be created
  + resource "aws_iam_role_policy_attachment" "VotingAppApi_VotingAppApi-OnRequest-52bc3c17_IamRolePolicyAttachment_92A90320" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = (known after apply)
    }

  # aws_iam_role_policy_attachment.VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_IamRolePolicyAttachment_055C2EDA will be created
  + resource "aws_iam_role_policy_attachment" "VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_IamRolePolicyAttachment_055C2EDA" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = (known after apply)
    }

  # aws_lambda_function.InitializeTable_Function_FD00736D will be created
  + resource "aws_lambda_function" "InitializeTable_Function_FD00736D" {
      + architectures                  = [
          + "arm64",
        ]
      + arn                            = (known after apply)
      + function_name                  = "Function-c8e7055b"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs18.x"
      + s3_bucket                      = (known after apply)
      + s3_key                         = "asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.78d9378353c823e56e038c34d0e0404e.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "WING_FUNCTION_NAME"         = "Function-c8e7055b"
              + "WING_TARGET"                = "tf-aws"
              + "WING_TOKEN_TFTOKEN_TOKEN_1" = "\"DynamoDBTableAws-4b65a10e\""
            }
        }

      + vpc_config {
          + vpc_id = (known after apply)
        }
    }

  # aws_lambda_function.VotingAppApi_VotingAppApi-OnRequest-41f14472_39478289 will be created
  + resource "aws_lambda_function" "VotingAppApi_VotingAppApi-OnRequest-41f14472_39478289" {
      + architectures                  = [
          + "arm64",
        ]
      + arn                            = (known after apply)
      + function_name                  = "VotingAppApi-OnRequest-41f14472-c87bddf9"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs18.x"
      + s3_bucket                      = (known after apply)
      + s3_key                         = "asset.c87bddf927b70f22f963a14d64ce5f4bf1372d398a.d2a486e6ea84b565fab40197756619bb.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "WING_FUNCTION_NAME"         = "VotingAppApi-OnRequest-41f14472-c87bddf9"
              + "WING_TARGET"                = "tf-aws"
              + "WING_TOKEN_TFTOKEN_TOKEN_1" = "\"DynamoDBTableAws-4b65a10e\""
            }
        }

      + vpc_config {
          + vpc_id = (known after apply)
        }
    }

  # aws_lambda_function.VotingAppApi_VotingAppApi-OnRequest-52bc3c17_02CD08E6 will be created
  + resource "aws_lambda_function" "VotingAppApi_VotingAppApi-OnRequest-52bc3c17_02CD08E6" {
      + architectures                  = [
          + "arm64",
        ]
      + arn                            = (known after apply)
      + function_name                  = "VotingAppApi-OnRequest-52bc3c17-c89daf14"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs18.x"
      + s3_bucket                      = (known after apply)
      + s3_key                         = "asset.c89daf14978fb4fcb47ef703ae9610992b519c2727.bc28bdef1aba59f9a5cf873b1d5c734a.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "WING_FUNCTION_NAME"         = "VotingAppApi-OnRequest-52bc3c17-c89daf14"
              + "WING_TARGET"                = "tf-aws"
              + "WING_TOKEN_TFTOKEN_TOKEN_1" = "\"DynamoDBTableAws-4b65a10e\""
            }
        }

      + vpc_config {
          + vpc_id = (known after apply)
        }
    }

  # aws_lambda_function.VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_93510F52 will be created
  + resource "aws_lambda_function" "VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_93510F52" {
      + architectures                  = [
          + "arm64",
        ]
      + arn                            = (known after apply)
      + function_name                  = "VotingAppApi-OnRequest-8d2e75ec-c8cf8e09"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs18.x"
      + s3_bucket                      = (known after apply)
      + s3_key                         = "asset.c8cf8e09741b572c80a663f9c8cf9ce40395e87b08.b7e344e30ab5c60a351047fb862a5c2a.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "WING_FUNCTION_NAME"         = "VotingAppApi-OnRequest-8d2e75ec-c8cf8e09"
              + "WING_TARGET"                = "tf-aws"
              + "WING_TOKEN_TFTOKEN_TOKEN_1" = "\"DynamoDBTableAws-4b65a10e\""
            }
        }

      + vpc_config {
          + vpc_id = (known after apply)
        }
    }

  # aws_lambda_permission.VotingAppApi_api_permission-GET-5969f3af_56B4A504 will be created
  + resource "aws_lambda_permission" "VotingAppApi_api_permission-GET-5969f3af_56B4A504" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "VotingAppApi-OnRequest-8d2e75ec-c8cf8e09"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromAPIGateway-GET-5969f3af"
      + statement_id_prefix = (known after apply)
    }

  # aws_lambda_permission.VotingAppApi_api_permission-POST-53dc1f64_98751060 will be created
  + resource "aws_lambda_permission" "VotingAppApi_api_permission-POST-53dc1f64_98751060" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "VotingAppApi-OnRequest-52bc3c17-c89daf14"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromAPIGateway-POST-53dc1f64"
      + statement_id_prefix = (known after apply)
    }

  # aws_lambda_permission.VotingAppApi_api_permission-POST-57590acc_3E83C8F6 will be created
  + resource "aws_lambda_permission" "VotingAppApi_api_permission-POST-57590acc_3E83C8F6" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "VotingAppApi-OnRequest-41f14472-c87bddf9"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromAPIGateway-POST-57590acc"
      + statement_id_prefix = (known after apply)
    }

  # aws_s3_bucket.Code will be created
  + resource "aws_s3_bucket" "Code" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "code-c84a50b1-"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket.cloudWebsite_WebsiteBucket_EB03D355 will be created
  + resource "aws_s3_bucket" "cloudWebsite_WebsiteBucket_EB03D355" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "cloud-website-c8e58765-"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_policy.cloudWebsite_DistributionS3BucketPolicy_32B029AE will be created
  + resource "aws_s3_bucket_policy" "cloudWebsite_DistributionS3BucketPolicy_32B029AE" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # aws_s3_bucket_website_configuration.cloudWebsite_BucketWebsiteConfiguration_920E8E41 will be created
  + resource "aws_s3_bucket_website_configuration" "cloudWebsite_BucketWebsiteConfiguration_920E8E41" {
      + bucket           = (known after apply)
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + index_document {
          + suffix = "index.html"
        }
    }

  # aws_s3_object.InitializeTable_Function_S3Object_F5933D3B will be created
  + resource "aws_s3_object" "InitializeTable_Function_S3Object_F5933D3B" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.78d9378353c823e56e038c34d0e0404e.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "assets/InitializeTable_Function_Asset_1A1B5BC3/78D9378353C823E56E038C34D0E0404E/archive.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.VotingAppApi_VotingAppApi-OnRequest-41f14472_S3Object_C95F6BA9 will be created
  + resource "aws_s3_object" "VotingAppApi_VotingAppApi-OnRequest-41f14472_S3Object_C95F6BA9" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "asset.c87bddf927b70f22f963a14d64ce5f4bf1372d398a.d2a486e6ea84b565fab40197756619bb.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "assets/VotingAppApi_VotingAppApi-OnRequest-41f14472_Asset_94F55D63/D2A486E6EA84B565FAB40197756619BB/archive.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.VotingAppApi_VotingAppApi-OnRequest-52bc3c17_S3Object_F3A42DC6 will be created
  + resource "aws_s3_object" "VotingAppApi_VotingAppApi-OnRequest-52bc3c17_S3Object_F3A42DC6" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "asset.c89daf14978fb4fcb47ef703ae9610992b519c2727.bc28bdef1aba59f9a5cf873b1d5c734a.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "assets/VotingAppApi_VotingAppApi-OnRequest-52bc3c17_Asset_FBAD96D6/BC28BDEF1ABA59F9A5CF873B1D5C734A/archive.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_S3Object_F8CCE004 will be created
  + resource "aws_s3_object" "VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_S3Object_F8CCE004" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "asset.c8cf8e09741b572c80a663f9c8cf9ce40395e87b08.b7e344e30ab5c60a351047fb862a5c2a.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "assets/VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_Asset_4A29FD21/B7E344E30AB5C60A351047FB862A5C2A/archive.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.cloudWebsite_File--asset-manifestjson_8187FE70 will be created
  + resource "aws_s3_object" "cloudWebsite_File--asset-manifestjson_8187FE70" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/json; charset=utf-8"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/asset-manifest.json"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/github/workspace/website/build/asset-manifest.json"
      + source_hash            = "52f5109f32b873252767713d89269205"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.cloudWebsite_File--faviconico_A86052F9 will be created
  + resource "aws_s3_object" "cloudWebsite_File--faviconico_A86052F9" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "image/vnd.microsoft.icon"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/favicon.ico"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/github/workspace/website/build/favicon.ico"
      + source_hash            = "c92b85a5b907c70211f4ec25e29a8c4a"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.cloudWebsite_File--indexhtml_2A2AE13C will be created
  + resource "aws_s3_object" "cloudWebsite_File--indexhtml_2A2AE13C" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/html; charset=utf-8"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/index.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/github/workspace/website/build/index.html"
      + source_hash            = "4e239ba18344df91ab374d4d3c11c146"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.cloudWebsite_File--logo192png_6E513B20 will be created
  + resource "aws_s3_object" "cloudWebsite_File--logo192png_6E513B20" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "image/png"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/logo192.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/github/workspace/website/build/logo192.png"
      + source_hash            = "33dbdd0177549353eeeb785d02c294af"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.cloudWebsite_File--logo512png_E26C5AA3 will be created
  + resource "aws_s3_object" "cloudWebsite_File--logo512png_E26C5AA3" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "image/png"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/logo512.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/github/workspace/website/build/logo512.png"
      + source_hash            = "917515db74ea8d1aee6a246cfbcc0b45"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.cloudWebsite_File--manifestjson_5AC33197 will be created
  + resource "aws_s3_object" "cloudWebsite_File--manifestjson_5AC33197" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/json; charset=utf-8"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/manifest.json"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/github/workspace/website/build/manifest.json"
      + source_hash            = "d9d975cebe2ec20b6c652e1e4c12ccf0"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.cloudWebsite_File--robotstxt_F93900E9 will be created
  + resource "aws_s3_object" "cloudWebsite_File--robotstxt_F93900E9" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/plain; charset=utf-8"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/robots.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/github/workspace/website/build/robots.txt"
      + source_hash            = "fa1ded1ed7c11438a9b0385b1e112850"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.cloudWebsite_File--static--css--mainbc8dc0a9css_ABAEC285 will be created
  + resource "aws_s3_object" "cloudWebsite_File--static--css--mainbc8dc0a9css_ABAEC285" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/css; charset=utf-8"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/static/css/main.bc8dc0a9.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/github/workspace/website/build/static/css/main.bc8dc0a9.css"
      + source_hash            = "54ec4ff3369108e3623984a09700699f"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.cloudWebsite_File--static--css--mainbc8dc0a9cssmap_D475E55B will be created
  + resource "aws_s3_object" "cloudWebsite_File--static--css--mainbc8dc0a9cssmap_D475E55B" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/json; charset=utf-8"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/static/css/main.bc8dc0a9.css.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/github/workspace/website/build/static/css/main.bc8dc0a9.css.map"
      + source_hash            = "d904f7a427a1856c82da69353e402c81"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.cloudWebsite_File--static--js--78728cb0dcdchunkjs_40889769 will be created
  + resource "aws_s3_object" "cloudWebsite_File--static--js--78728cb0dcdchunkjs_40889769" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript; charset=utf-8"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/static/js/787.28cb0dcd.chunk.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/github/workspace/website/build/static/js/787.28cb0dcd.chunk.js"
      + source_hash            = "7e5ef725749e7fbe0082ba21eb2572ef"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.cloudWebsite_File--static--js--78728cb0dcdchunkjsmap_F5D0643F will be created
  + resource "aws_s3_object" "cloudWebsite_File--static--js--78728cb0dcdchunkjsmap_F5D0643F" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/json; charset=utf-8"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/static/js/787.28cb0dcd.chunk.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/github/workspace/website/build/static/js/787.28cb0dcd.chunk.js.map"
      + source_hash            = "312c0eedefe8c3be0e90be0bc727cc9e"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.cloudWebsite_File--static--js--mainf35fcf80jsLICENSEtxt_E95A10E1 will be created
  + resource "aws_s3_object" "cloudWebsite_File--static--js--mainf35fcf80jsLICENSEtxt_E95A10E1" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/plain; charset=utf-8"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/static/js/main.f35fcf80.js.LICENSE.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/github/workspace/website/build/static/js/main.f35fcf80.js.LICENSE.txt"
      + source_hash            = "8dffae291722641df11b29bdf4b1f953"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.cloudWebsite_File--static--js--mainf35fcf80js_5A79BA2F will be created
  + resource "aws_s3_object" "cloudWebsite_File--static--js--mainf35fcf80js_5A79BA2F" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript; charset=utf-8"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/static/js/main.f35fcf80.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/github/workspace/website/build/static/js/main.f35fcf80.js"
      + source_hash            = "899b9e12808849cf665476ecf28c771d"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.cloudWebsite_File--static--js--mainf35fcf80jsmap_8EB0B4F9 will be created
  + resource "aws_s3_object" "cloudWebsite_File--static--js--mainf35fcf80jsmap_8EB0B4F9" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/json; charset=utf-8"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/static/js/main.f35fcf80.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/github/workspace/website/build/static/js/main.f35fcf80.js.map"
      + source_hash            = "dc25a1be84198ff9fd061bdede4defa4"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.cloudWebsite_File-configjson_591A81BA will be created
  + resource "aws_s3_object" "cloudWebsite_File-configjson_591A81BA" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content                = (known after apply)
      + content_type           = "application/json"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "config.json"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 52 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ApiUrl                                = (known after apply)
  + WING_TEST_RUNNER_FUNCTION_IDENTIFIERS = jsonencode([])
  + WebsiteUrl                            = (known after apply)

```

</details>
